CREATE TABLE avm_billing (
    billing_id     INT PRIMARY KEY,
    billing_date   DATE NOT NULL,
    billing_month  CHAR(7) NOT NULL,
    customer_name  VARCHAR(100) NOT NULL,
    service_name   VARCHAR(50) NOT NULL,
    usage_amount   INT NOT NULL,
    unit_price     INT NOT NULL,
    total_price    INT NOT NULL,
    status         VARCHAR(20) NOT NULL
);



INSERT INTO avm_billing 
(billing_id, billing_date, billing_month, customer_name, service_name, usage_amount, unit_price, total_price, status)
VALUES
(1, '2025-12-01', '2025-12', '테슬라코리아', 'API', 1200, 15, 18000, 'PAID'),
(2, '2025-12-01', '2025-12', '포드모터스', 'DASHBOARD', 40, 3000, 120000, 'BILLED'),
(3, '2025-12-02', '2025-12', '삼성전자', 'STORAGE', 300, 5, 1500, 'READY'),
(4, '2025-12-02', '2025-12', 'LG CNS', 'API', 900, 12, 10800, 'PAID'),
(5, '2025-12-02', '2025-12', '카카오엔터프라이즈', 'API', 700, 14, 9800, 'BILLED'),
(6, '2025-12-03', '2025-12', '네이버클라우드', 'STORAGE', 200, 4, 800, 'PAID'),
(7, '2025-12-03', '2025-12', 'KT Cloud', 'DASHBOARD', 30, 2800, 84000, 'READY'),
(8, '2025-12-03', '2025-12', '현대오토에버', 'API', 1500, 13, 19500, 'PAID'),
(9, '2025-12-04', '2025-12', '우아한형제들', 'API', 1100, 12, 13200, 'READY'),
(10,'2025-12-04', '2025-12', '요기요', 'STORAGE', 320, 4, 1280, 'BILLED'),

(11,'2025-12-05','2025-12','배민커넥트','API',650,15,9750,'PAID'),
(12,'2025-12-05','2025-12','카카오모빌리티','DASHBOARD',60,2500,150000,'READY'),
(13,'2025-12-05','2025-12','쏘카','API',900,14,12600,'BILLED'),
(14,'2025-12-06','2025-12','티맵모빌리티','STORAGE',500,5,2500,'PAID'),
(15,'2025-12-06','2025-12','쿠팡','API',1800,13,23400,'PAID'),
(16,'2025-12-06','2025-12','마켓컬리','API',760,12,9120,'READY'),
(17,'2025-12-07','2025-12','SK텔레콤','DASHBOARD',70,2900,203000,'BILLED'),
(18,'2025-12-07','2025-12','라인플러스','API',940,11,10340,'PAID'),
(19,'2025-12-07','2025-12','NHN','STORAGE',420,6,2520,'BILLED'),
(20,'2025-12-08','2025-12','BC카드','API',820,15,12300,'READY'),

(21,'2025-12-08','2025-12','신한카드','DASHBOARD',55,2800,154000,'PAID'),
(22,'2025-12-08','2025-12','KB국민카드','API',1000,12,12000,'READY'),
(23,'2025-12-09','2025-12','카카오페이','STORAGE',230,5,1150,'BILLED'),
(24,'2025-12-09','2025-12','토스페이먼츠','API',1120,14,15680,'PAID'),
(25,'2025-12-09','2025-12','롯데정보통신','API',780,12,9360,'READY'),
(26,'2025-12-10','2025-12','CJ올리브네트웍스','DASHBOARD',48,3000,144000,'PAID'),
(27,'2025-12-10','2025-12','SSG닷컴','API',1320,13,17160,'BILLED'),
(28,'2025-12-10','2025-12','요기요익스프레스','STORAGE',350,5,1750,'PAID'),
(29,'2025-12-10','2025-12','GS리테일','API',880,11,9680,'READY'),
(30,'2025-12-11','2025-12','이마트24','API',910,10,9100,'BILLED');